InformationRegisters/ИсторияСамостоятельныхКлассификационныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСамостоятельныхКлассификационныхЕдиниц</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СКЕ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СамостоятельныеКлассификационныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СамостоятельныеКлассификационныеЕдиницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СамостоятельныеКлассификационныеЕдиницы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассПрофессиональногоРиска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасформирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочиванияИерархического</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяемыйЛьготныйТерриториальныйТариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТарифовСтраховыхВзносов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыСотрудников</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГрафикРаботыСотрудниковПодразделенияОрганизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмеетНомерТерриториальногоОрганаРосстата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТерриториальногоОрганаРосстата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганаФСГС</Name>
					<Comment>Код органа Федеральной службы государственной статистики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОКВЭД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СамостоятельнаяКлассификационнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СамостоятельныеКлассификационныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляЗаписейОТрудовойДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимыеСтажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСтажа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыСтажа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/РедактированиеСамостоятельнойКлассификационнойЕдиницы/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПрочитатьСамостоятельнуюКлассификационнуюЕдиницу();
	ИнициализироватьФорму();
	
	Если Параметры.Свойство("ИмяРеквизита") И Не ПустаяСтрока(Параметры.ИмяРеквизита) Тогда
		
		Если Не ПустаяСтрока(Параметры.ИмяРеквизита) Тогда
			
			ТекущийЭлементФормы = Элементы.Найти(Параметры.ИмяРеквизита);
			Если ТекущийЭлементФормы <> Неопределено Тогда
				ТекущийЭлемент = ТекущийЭлементФормы;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(
	ЭтаФорма, "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев", СамостоятельнаяКлассификационнаяЕдиница.Ссылка);
	УчетСтраховыхВзносовКлиентСервер.ОбновитьПолеСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериод(
	ЭтаФорма, СамостоятельнаяКлассификационнаяЕдиница.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОтредактированаИстория"
		И Параметр.ИмяРегистра = "ИсторияСамостоятельныхКлассификационныхЕдиниц"
		И Источник = СтруктурнаяЕдиница Тогда
		
		Если ЗначениеЗаполнено(СамостоятельнаяКлассификационнаяЕдиница.Ссылка)
			ИЛИ Параметр.МассивЗаписей.Количество() > 0 Тогда
			
			РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(ЭтотОбъект, СтруктурнаяЕдиница, ИмяСобытия, 
				Параметр, Источник);
			ПоместитьДанныеСКЕВФорму(ИсторияСамостоятельныхКлассификационныхЕдиниц.СКЕ);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ОтредактированаИстория"
		И Параметр.ИмяРегистра = "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев" Тогда
		
			РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(ЭтотОбъект, ИсторияСамостоятельныхКлассификационныхЕдиниц.СКЕ, ИмяСобытия, 
				Параметр, Источник);
			УчетСтраховыхВзносовКлиентСервер.ОбновитьПолеСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериод(ЭтотОбъект, 
				ИсторияСамостоятельныхКлассификационныхЕдиниц.СКЕ);
				
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Попытка
		СамостоятельнаяКлассификационнаяЕдиницаОбъект = РеквизитФормыВЗначение("СамостоятельнаяКлассификационнаяЕдиница");
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки(), , , , Отказ);
	КонецПопытки;
	
	Если НЕ Отказ Тогда
		РедактированиеПериодическихСведений.ПроверитьЗаписьВФорме(ЭтаФорма, 
		"ИсторияСамостоятельныхКлассификационныхЕдиниц", СтруктурнаяЕдиница, Отказ);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ОбновитьИсторияСамостоятельныхКлассификационныхЕдиницПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСамостоятельныхКлассификационныхЕдиницПериодПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(
	ЭтаФорма,
	"ИсторияСамостоятельныхКлассификационныхЕдиницПериод",
	"ИсторияСамостоятельныхКлассификационныхЕдиницПериодСтрокой",
	Модифицированность);
	
	ИсторияСамостоятельныхКлассификационныхЕдиниц.Период = ИсторияСамостоятельныхКлассификационныхЕдиницПериод;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСамостоятельныхКлассификационныхЕдиницПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения(
	"ИсторияСамостоятельныхКлассификационныхЕдиницПериодНачалоВыбораЗавершение", ЭтотОбъект);
	
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(
	ЭтаФорма,
	ЭтаФорма,
	"ИсторияСамостоятельныхКлассификационныхЕдиницПериод",
	"ИсторияСамостоятельныхКлассификационныхЕдиницПериодСтрокой", ,
	Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСамостоятельныхКлассификационныхЕдиницПериодНачалоВыбораЗавершение(ЗначениеВыбрано, 
	ДополнительныеПараметры) Экспорт 
	
	ИсторияСамостоятельныхКлассификационныхЕдиниц.Период = ИсторияСамостоятельныхКлассификационныхЕдиницПериод;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСамостоятельныхКлассификационныхЕдиницПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(
	ЭтаФорма,
	"ИсторияСамостоятельныхКлассификационныхЕдиницПериод",
	"ИсторияСамостоятельныхКлассификационныхЕдиницПериодСтрокой",
	Направление,
	Модифицированность);
	
	ИсторияСамостоятельныхКлассификационныхЕдиниц.Период = ИсторияСамостоятельныхКлассификационныхЕдиницПериод;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСамостоятельныхКлассификационныхЕдиницПериодСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, 
	ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСамостоятельныхКлассификационныхЕдиницПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, 
	ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьЗавершение", ЭтотОбъект);
	ЗаписатьСамостоятельнуюКлассификационнуюЕдиницу(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьЗавершение(Отказ, ДополнительныеПараметры) Экспорт 
	
	Если Не Отказ Тогда
		Оповестить("Запись_Организации", , СамостоятельнаяКлассификационнаяЕдиница.Владелец);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСамостоятельныхКлассификационныхЕдиницИстория(Команда)
	
	Отказ = Ложь;
	
	Если Модифицированность Тогда
		
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		
		Оповещение = Новый ОписаниеОповещения("ИсторияСамостоятельныхКлассификационныхЕдиницИсторияПродолжение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена);
		
	Иначе 
		
		ИсторияСамостоятельныхКлассификационныхЕдиницИсторияПродолжение(КодВозвратаДиалога.Да, Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСамостоятельныхКлассификационныхЕдиницИсторияПродолжение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ИсторияСамостоятельныхКлассификационныхЕдиницИсторияЗавершение", 
		ЭтотОбъект);
		ЗаписатьСамостоятельнуюКлассификационнуюЕдиницу(Оповещение);
	Иначе 
		ИсторияСамостоятельныхКлассификационныхЕдиницИсторияЗавершение(Ложь, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСамостоятельныхКлассификационныхЕдиницИсторияЗавершение(Отказ, ДополнительныеПараметры) Экспорт 
	
	Если Не Отказ Тогда 
		РедактированиеПериодическихСведенийКлиент.ОткрытьИсторию("ИсторияСамостоятельныхКлассификационныхЕдиниц", 
		СтруктурнаяЕдиница, ЭтаФорма, ТолькоПросмотр);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФорму()
	
	ЭтоОбособленноеПодразделение = Ложь;
	
	Если ЗначениеЗаполнено(СамостоятельнаяКлассификационнаяЕдиница.Владелец) Тогда 
		
		Элементы.Владелец.ТолькоПросмотр = Истина;
		Элементы.Владелец.КнопкаОткрытия = Ложь;
		Элементы.Владелец.КнопкаВыбора = Ложь;
		Элементы.Владелец.АвтоОтметкаНезаполненного = Ложь;
		
		Если СамостоятельнаяКлассификационнаяЕдиница.Владелец.Метаданные().Реквизиты.Найти(
			"ЮридическоеФизическоеЛицо") <> Неопределено
			И СамостоятельнаяКлассификационнаяЕдиница.Владелец.Метаданные().Реквизиты.Найти(
			"ОбособленноеПодразделение") <> Неопределено Тогда 
			
			РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			СамостоятельнаяКлассификационнаяЕдиница.Владелец, "ЮридическоеФизическоеЛицо, ОбособленноеПодразделение");
			
			ЭтоОбособленноеПодразделение = РеквизитыОрганизации.ЮридическоеФизическоеЛицо 
			= Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо
			И РеквизитыОрганизации.ОбособленноеПодразделение;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоОбособленноеПодразделение Тогда
		
		ГоловнаяОрганизация = РегламентированнаяОтчетность.ГоловнаяОрганизация(
		СамостоятельнаяКлассификационнаяЕдиница.Владелец);
		
	Иначе
		
		Элементы.Владелец.Заголовок	= НСтр("ru = 'Организация'");
		Элементы.ГоловнаяОрганизация.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСамостоятельнуюКлассификационнуюЕдиницу()
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(СтруктурнаяЕдиница) = Тип("СправочникСсылка.Организации") Тогда
		ОрганизацияВладельцаСамостоятельнойКлассификационнойЕдиницы = СтруктурнаяЕдиница;
	Иначе
		ОрганизацияВладельцаСамостоятельнойКлассификационнойЕдиницы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		СтруктурнаяЕдиница, "Владелец");
	КонецЕсли;
	
	ВладелецСамостоятельнойКлассификационнойЕдиницы = ЗарплатаКадры.ГоловнаяОрганизация(
	ОрганизацияВладельцаСамостоятельнойКлассификационнойЕдиницы);
	
	Запрос.УстановитьПараметр("Владелец", ВладелецСамостоятельнойКлассификационнойЕдиницы);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СамостоятельныеКлассификационныеЕдиницы.Ссылка КАК СамостоятельнаяКлассификационнаяЕдиница,
	|	СамостоятельныеКлассификационныеЕдиницы.Наименование
	|ИЗ
	|	Справочник.СамостоятельныеКлассификационныеЕдиницы КАК СамостоятельныеКлассификационныеЕдиницы
	|ГДЕ
	|	СамостоятельныеКлассификационныеЕдиницы.Владелец = &Владелец";
	
	ВсеСамостоятельныеКлассификационныеЕдиницы.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, 
	"ИсторияСамостоятельныхКлассификационныхЕдиниц", СтруктурнаяЕдиница);
	Если НЕ ЗначениеЗаполнено(ИсторияСамостоятельныхКлассификационныхЕдиниц.СКЕ) Тогда
		ИсторияСамостоятельныхКлассификационныхЕдиниц.СКЕ = СтруктурнаяЕдиница.СамостоятельнаяКлассификационнаяЕдиница;
		ИсторияСамостоятельныхКлассификационныхЕдиницНоваяЗапись = Истина;
	КонецЕсли;
	
	ПоместитьДанныеСКЕВФорму(ИсторияСамостоятельныхКлассификационныхЕдиниц.СКЕ);
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьДанныеСКЕВФорму(СамостоятельнаяКлассификационнаяЕдиницаСсылка, ОбновитьДанныеПрежней = Истина)
	
	Если СамостоятельнаяКлассификационнаяЕдиницаСсылка.Пустая() Тогда
		СамостоятельнаяКлассификационнаяЕдиницаОбъект = Неопределено;
	Иначе
		СамостоятельнаяКлассификационнаяЕдиницаОбъект = СамостоятельнаяКлассификационнаяЕдиницаСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если СамостоятельнаяКлассификационнаяЕдиницаОбъект = Неопределено Тогда
		СамостоятельнаяКлассификационнаяЕдиницаОбъект = Справочники.СамостоятельныеКлассификационныеЕдиницы.СоздатьЭлемент();
		СамостоятельнаяКлассификационнаяЕдиницаОбъект.Владелец = ВладелецСамостоятельнойКлассификационнойЕдиницы;
	КонецЕсли;
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	ЗначениеВРеквизитФормы(СамостоятельнаяКлассификационнаяЕдиницаОбъект, "СамостоятельнаяКлассификационнаяЕдиница");
	Если ОбновитьДанныеПрежней Тогда
		ЗначениеВРеквизитФормы(СамостоятельнаяКлассификационнаяЕдиницаОбъект, 
		"СамостоятельнаяКлассификационнаяЕдиницаПрежняя");
	КонецЕсли;
	
	ОбновитьИсторияСамостоятельныхКлассификационныхЕдиницПериод(ЭтаФорма, ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСамостоятельнуюКлассификационнуюЕдиницу(ОповещениеЗакрытия = Неопределено)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		
		Отказ = Истина;
		Если ОповещениеЗакрытия <> Неопределено Тогда 
			ВыполнитьОбработкуОповещения(ОповещениеЗакрытия, Отказ);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ОповещениеЗакрытия", ОповещениеЗакрытия);
	
	Если Не ЗначениеЗаполнено(ИсторияСамостоятельныхКлассификационныхЕдиницПрежняя.СКЕ) Тогда
		
		ЗаписатьСамостоятельнуюКлассификационнуюЕдиницуЗавершение(Неопределено, ДополнительныеПараметры);
		Возврат;
		
	КонецЕсли; 
	
	ТекстКнопкиДа = НСтр("ru = 'Изменились данные о самостоятельной классификационной единице'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'При редактировании изменили данные о самостоятельной классификационной единице. 
		|Если была исправлена прежняя запись (она была ошибочной), нажмите ""Исправлена ошибка"".
		|Если изменились данные о самостоятельной классификационной единице с %1, нажмите ""%2""'"), 
		Формат(ИсторияСамостоятельныхКлассификационныхЕдиниц.Период, НСтр("ru='ДФ=ММММ гггг ""г""'")),
		ТекстКнопкиДа);
	
	МассивИменПроверяемыхРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		КлючевыеРеквизитыСамостоятельнойКлассификационнойЕдиницы());
	
	ОбъектИзменен = Ложь;
	Для каждого ИмяПроверяемогоРеквизита Из МассивИменПроверяемыхРеквизитов Цикл
		Если СамостоятельнаяКлассификационнаяЕдиница[ИмяПроверяемогоРеквизита] 
			<> СамостоятельнаяКлассификационнаяЕдиницаПрежняя[ИмяПроверяемогоРеквизита] Тогда
			ОбъектИзменен = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбъектИзменен И ИсторияСамостоятельныхКлассификационныхЕдиниц.Период 
		<> ИсторияСамостоятельныхКлассификационныхЕдиницПрежняя.Период Тогда
		
		Кнопки = Новый СписокЗначений();
		Кнопки.Добавить(КодВозвратаДиалога.Нет,  	НСтр("ru = 'Исправлена ошибка'"));
		Кнопки.Добавить(КодВозвратаДиалога.Да, 		ТекстКнопкиДа);
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, 	НСтр("ru = 'Отмена'"));
		
		Оповещение = Новый ОписаниеОповещения("ЗаписатьСамостоятельнуюКлассификационнуюЕдиницуЗавершение", 
		ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Отмена);
		
	Иначе
		
		ЗаписатьСамостоятельнуюКлассификационнуюЕдиницуЗавершение(Неопределено, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСамостоятельнуюКлассификационнуюЕдиницуЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Отказ = Ложь;
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Отказ = Истина;
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		ИсторияСамостоятельныхКлассификационныхЕдиницНоваяЗапись = Истина;
	КонецЕсли;
	
	Если Не Отказ Тогда
		ЗаписатьСамостоятельнуюКлассификационнуюЕдиницуНаСервере(Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		ПараметрОповещения = Новый Структура("Ссылка, Владелец", СамостоятельнаяКлассификационнаяЕдиница.Ссылка, 
		СамостоятельнаяКлассификационнаяЕдиница.Владелец);
		Оповестить("ИзмененаСамостоятельнаяКлассификационнаяЕдиница", ПараметрОповещения, ВладелецФормы);
	КонецЕсли;
	
	Если ДополнительныеПараметры.ОповещениеЗакрытия <> Неопределено Тогда 
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеЗакрытия, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСамостоятельнуюКлассификационнуюЕдиницуНаСервере(Отказ)
	
	СуществующаяЗапись = Неопределено;
	Если ИсторияСамостоятельныхКлассификационныхЕдиницНоваяЗапись 
		И ЗначениеЗаполнено(СамостоятельнаяКлассификационнаяЕдиницаПрежняя.Наименование) Тогда
		
		СуществующаяЗапись = ПолучитьСуществующуюСКЕ(СамостоятельнаяКлассификационнаяЕдиница.Владелец, 
		СамостоятельнаяКлассификационнаяЕдиница.Наименование, СамостоятельнаяКлассификационнаяЕдиница.КодОКВЭД2, 
		СамостоятельнаяКлассификационнаяЕдиница.КлассПрофессиональногоРиска);
		
		Если СуществующаяЗапись = Неопределено Тогда
			СКЕОбъект = Справочники.СамостоятельныеКлассификационныеЕдиницы.СоздатьЭлемент();
		Иначе
			СКЕОбъект = СуществующаяЗапись.ПолучитьОбъект();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СКЕОбъект, РеквизитФормыВЗначение("СамостоятельнаяКлассификационнаяЕдиница"), 
		КлючевыеРеквизитыСамостоятельнойКлассификационнойЕдиницы());
		СКЕОбъект.Владелец = СамостоятельнаяКлассификационнаяЕдиница.Владелец;
		
	Иначе
		СКЕОбъект = РеквизитФормыВЗначение("СамостоятельнаяКлассификационнаяЕдиница");
	КонецЕсли;
	
	Попытка
		
		СКЕОбъект.Записать();
		
		Если ИсторияСамостоятельныхКлассификационныхЕдиницНоваяЗапись И СуществующаяЗапись = Неопределено Тогда
			
			ЗаписьВсехСКЕ = ВсеСамостоятельныеКлассификационныеЕдиницы.Добавить();
			ЗаписьВсехСКЕ.Наименование = СамостоятельнаяКлассификационнаяЕдиница.Наименование;
			ЗаписьВсехСКЕ.КодОКВЭД2 = СамостоятельнаяКлассификационнаяЕдиница.КодОКВЭД2;
			ЗаписьВсехСКЕ.НаименованиеОКВЭД2 = СамостоятельнаяКлассификационнаяЕдиница.НаименованиеОКВЭД2;
			ЗаписьВсехСКЕ.КлассПрофессиональногоРиска = СамостоятельнаяКлассификационнаяЕдиница.КлассПрофессиональногоРиска;
			ЗаписьВсехСКЕ.СамостоятельнаяКлассификационнаяЕдиница = СамостоятельнаяКлассификационнаяЕдиница.Ссылка;
			
		КонецЕсли;
		
	Исключение
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	ЗначениеВРеквизитФормы(СКЕОбъект, "СамостоятельнаяКлассификационнаяЕдиница");
	
	ДополнительныеСвойства = Неопределено;
	Если НЕ ЗначениеЗаполнено(ИсторияСамостоятельныхКлассификационныхЕдиницПрежняя.СКЕ) Тогда
		ДополнительныеСвойства = Новый Структура("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
	КонецЕсли; 
	
	ИсторияСамостоятельныхКлассификационныхЕдиниц.СКЕ = СКЕОбъект.Ссылка;
	
	РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтаФорма, 
	"ИсторияСамостоятельныхКлассификационныхЕдиниц", СтруктурнаяЕдиница, , ДополнительныеСвойства);
	
	ПодчиненныеСтруктурныеЕдиницы = Справочники.ПодразделенияОрганизаций.ПодчиненныеСтруктурныеЕдиницы(СтруктурнаяЕдиница);
	РегистрыСведений.ИсторияСамостоятельныхКлассификационныхЕдиниц.ОбновитьПодчиненныеСтруктурныеЕдиницы(
	ПодчиненныеСтруктурныеЕдиницы);
	РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтаФорма, 
	"СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев", СКЕОбъект.Ссылка);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Модифицированность = Ложь;
	ПрочитатьСамостоятельнуюКлассификационнуюЕдиницу();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуществующуюСКЕ(Владелец, Наименование, КодОКВЭД2, КлассПрофессиональногоРиска)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СамостоятельныеКлассификационныеЕдиницы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СамостоятельныеКлассификационныеЕдиницы КАК СамостоятельныеКлассификационныеЕдиницы
	|ГДЕ
	|	СамостоятельныеКлассификационныеЕдиницы.Владелец = &Владелец
	|	И СамостоятельныеКлассификационныеЕдиницы.КодОКВЭД2 = &КодОКВЭД2
	|	И СамостоятельныеКлассификационныеЕдиницы.КлассПрофессиональногоРиска = &КлассПрофессиональногоРиска
	|	И НЕ СамостоятельныеКлассификационныеЕдиницы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("КодОКВЭД2", КодОКВЭД2);
	Запрос.УстановитьПараметр("КлассПрофессиональногоРиска", КлассПрофессиональногоРиска);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КлючевыеРеквизитыСамостоятельнойКлассификационнойЕдиницы()
	
	Возврат "КодОКВЭД2,КлассПрофессиональногоРиска,Наименование";
	
КонецФункции

// АПК:78-выкл: экспорт нужен для вызова из РедактированиеПериодическихСведений

&НаСервере
Процедура ПрочитатьНаборЗаписейПериодическихСведений(ИмяРегистра, ВедущийОбъект) Экспорт
	
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(ЭтаФорма, ИмяРегистра, ВедущийОбъект);
	
КонецПроцедуры

// АПК:78-вкл

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИсторияСамостоятельныхКлассификационныхЕдиницПериод(Форма, ДатаСеанса)
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма, 
	"ИсторияСамостоятельныхКлассификационныхЕдиниц", Форма.СтруктурнаяЕдиница);
	
	Если (Форма.ИсторияСамостоятельныхКлассификационныхЕдиницПрежняя.Период 
		= НачалоМесяца(ЗарплатаКадрыКлиентСервер.ДатаОтсчетаПериодическихСведенийСПериодомМесяц())
		ИЛИ Форма.ИсторияСамостоятельныхКлассификационныхЕдиницПрежняя.Период = '00010101') 
		И НЕ Форма.Модифицированность Тогда
		
		Форма.Элементы.ИсторияСамостоятельныхКлассификационныхЕдиницПериодСтрокой.АвтоОтметкаНезаполненного = Ложь;
		Форма.Элементы.ИсторияСамостоятельныхКлассификационныхЕдиницПериодСтрокой.ОтметкаНезаполненного = Ложь;
		
	Иначе
		Если Форма.Модифицированность
			И (Форма.ИсторияСамостоятельныхКлассификационныхЕдиницПрежняя.Период = '00010101'
			Или Форма.ИсторияСамостоятельныхКлассификационныхЕдиниц.Период 
			= НачалоМесяца(ЗарплатаКадрыКлиентСервер.ДатаОтсчетаПериодическихСведенийСПериодомМесяц())) Тогда
			Форма.ИсторияСамостоятельныхКлассификационныхЕдиниц.Период = НачалоМесяца(ДатаСеанса);
		КонецЕсли;
	КонецЕсли;
	
	Если Форма.ИсторияСамостоятельныхКлассификационныхЕдиниц.Период 
		= НачалоМесяца(ЗарплатаКадрыКлиентСервер.ДатаОтсчетаПериодическихСведенийСПериодомМесяц()) Тогда
		Форма.ИсторияСамостоятельныхКлассификационныхЕдиницПериод = '00010101';
	Иначе
		Форма.ИсторияСамостоятельныхКлассификационныхЕдиницПериод 
		= Форма.ИсторияСамостоятельныхКлассификационныхЕдиниц.Период;
	КонецЕсли;
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, "ИсторияСамостоятельныхКлассификационныхЕдиницПериод", 
	"ИсторияСамостоятельныхКлассификационныхЕдиницПериодСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Результат, ДополнительныеПараметры) Экспорт 
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрытьЗавершение", ЭтотОбъект);
	ЗаписатьСамостоятельнуюКлассификационнуюЕдиницу(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрытьЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Не Отказ Тогда 
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(
	ЭтаФорма, "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период", 
	"СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(
	ЭтаФорма,
	ЭтаФорма,
	"СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период",
	"СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокой",
	,
	,
	НачалоГода(ОбщегоНазначенияКлиент.ДатаСеанса()));
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияИстории(ИмяРегистра, ВедущийОбъект, Форма, ЗапретРедактирования = Ложь)
	
	ТолькоПросмотрИстории = Форма.ТолькоПросмотр ИЛИ ЗапретРедактирования;
	Если Не ТолькоПросмотрИстории Тогда
		Попытка
			Форма.ЗаблокироватьДанныеФормыДляРедактирования();
			ТолькоПросмотрИстории = Ложь;
		Исключение
			ТолькоПросмотрИстории = Истина;
		КонецПопытки
	КонецЕсли;
	РедактированиеПериодическихСведенийКлиент.ОткрытьИсторию(ИмяРегистра, ВедущийОбъект, Форма, ТолькоПросмотрИстории);
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(
	ЭтаФорма, "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период", 
	"СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокой",
	Направление, Модифицированность, НачалоГода(ОбщегоНазначенияКлиент.ДатаСеанса()));
КонецПроцедуры

&НаКлиенте
Процедура СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, 
	ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевПериодСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, 
	ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевИстория(Команда)
	
	Отказ = Ложь;
	
	Если Модифицированность Тогда
		
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		
		Оповещение = Новый ОписаниеОповещения("СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевИсторияПродолжение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена);
		
	Иначе 
		
		СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевИсторияПродолжение(КодВозвратаДиалога.Да, Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевИсторияПродолжение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевИсторияЗавершение", ЭтотОбъект);
		ЗаписатьСамостоятельнуюКлассификационнуюЕдиницу(Оповещение);
	Иначе 
		СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевИсторияЗавершение(Ложь, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевИсторияЗавершение(Отказ, ДополнительныеПараметры) Экспорт 
	
	Если Не Отказ Тогда 
		ОткрытьФормуРедактированияИстории("СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев", 
		СамостоятельнаяКлассификационнаяЕдиница.Ссылка, ЭтаФорма);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КодОКВЭД2ПриИзменении(Элемент)
	
	ОбновитьИсторияСамостоятельныхКлассификационныхЕдиницПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
	
КонецПроцедуры

&НаКлиенте
Процедура КлассПрофессиональногоРискаПриИзменении(Элемент)
	
	ОбновитьИсторияСамостоятельныхКлассификационныхЕдиницПериод(ЭтаФорма, ОбщегоНазначенияКлиент.ДатаСеанса());
	
КонецПроцедуры

#КонецОбласти
